MikroElektronika/core_packages/RX/gcc/def/renesas/R5F526TACDFL/mcu.h
typedef enum enum_dtce {
DTCE_ICU_SWINT2=26,DTCE_ICU_SWINT,
DTCE_CMT0_CMI0,
DTCE_CMT1_CMI1,
DTCE_CMT2_CMI2,
DTCE_CMT3_CMI3,
DTCE_RSPI0_SPRI0=38,DTCE_RSPI0_SPTI0,
DTCE_RI3C0_RESPI,DTCE_RI3C0_CMDI,DTCE_RI3C0_IBII,DTCE_RI3C0_RCVI,
DTCE_RSPIA0_SPRI=48,DTCE_RSPIA0_SPTI,
DTCE_RIIC0_RXI0=52,DTCE_RIIC0_TXI0,
DTCE_SCI1_RXI1=60,DTCE_SCI1_TXI1,
DTCE_ICU_IRQ0=64,DTCE_ICU_IRQ1,DTCE_ICU_IRQ2,DTCE_ICU_IRQ3,DTCE_ICU_IRQ4,DTCE_ICU_IRQ5,DTCE_ICU_IRQ6,DTCE_ICU_IRQ7,
DTCE_ICU_IRQ8,DTCE_ICU_IRQ9,DTCE_ICU_IRQ10,DTCE_ICU_IRQ11,DTCE_ICU_IRQ12,DTCE_ICU_IRQ13,DTCE_ICU_IRQ14,DTCE_ICU_IRQ15,
DTCE_SCI5_RXI5=84,DTCE_SCI5_TXI5,
DTCE_SCI6_RXI6,DTCE_SCI6_TXI6,
DTCE_RSCI8_RXI=100,DTCE_RSCI8_TXI,
DTCE_RSCI9_RXI,DTCE_RSCI9_TXI,
DTCE_RSCI11_RXI=114,DTCE_RSCI11_TXI,
DTCE_SCI12_RXI12,DTCE_SCI12_TXI12,
DTCE_RI3C0_RXI,DTCE_RI3C0_TXI,
DTCE_DMAC_DMAC0I,DTCE_DMAC_DMAC1I,DTCE_DMAC_DMAC2I,DTCE_DMAC_DMAC3I,
DTCE_S12AD_S12ADI=128,DTCE_S12AD_S12GBADI,DTCE_S12AD_S12GCADI,
DTCE_S12AD1_S12ADI1=132,DTCE_S12AD1_S12GBADI1,DTCE_S12AD1_S12GCADI1,
DTCE_S12AD2_S12ADI2=136,DTCE_S12AD2_S12GBADI2,DTCE_S12AD2_S12GCADI2,
DTCE_CANFD_RFDREQ0=140,DTCE_CANFD_RFDREQ1,
DTCE_CANFD0_CFDREQ0,
DTCE_TMR0_CMIA0=146,DTCE_TMR0_CMIB0,
DTCE_TMR1_CMIA1=149,DTCE_TMR1_CMIB1,
DTCE_TMR2_CMIA2=152,DTCE_TMR2_CMIB2,
DTCE_TMR3_CMIA3=155,DTCE_TMR3_CMIB3,
DTCE_TMR4_CMIA4=158,DTCE_TMR4_CMIB4,
DTCE_TMR5_CMIA5=161,DTCE_TMR5_CMIB5,
DTCE_TMR6_CMIA6=164,DTCE_TMR6_CMIB6,
DTCE_TMR7_CMIA7=167,DTCE_TMR7_CMIB7,
DTCE_ELC_ELSR18I=175,DTCE_ELC_ELSR19I,
DTCE_TSIP_RD,DTCE_TSIP_WR,
DTCE_CMPC0_CMPC0=180,
DTCE_CMPC1_CMPC1,
DTCE_CMPC2_CMPC2,
DTCE_CMPC3_CMPC3,
DTCE_CMPC4_CMPC4,
DTCE_CMPC5_CMPC5,
DTCE_CMTW0_CMWI0,DTCE_CMTW0_IC0I0,DTCE_CMTW0_IC1I0,DTCE_CMTW0_OC0I0,DTCE_CMTW0_OC1I0,
DTCE_CMTW1_CMWI1,DTCE_CMTW1_IC0I1,DTCE_CMTW1_IC1I1,DTCE_CMTW1_OC0I1,DTCE_CMTW1_OC1I1,
DTCE_RSCI9_AED=197,
DTCE_PERIA_INTA208=208,DTCE_PERIA_INTA209,DTCE_PERIA_INTA210,DTCE_PERIA_INTA211,DTCE_PERIA_INTA212,DTCE_PERIA_INTA213,
DTCE_PERIA_INTA214,DTCE_PERIA_INTA215,DTCE_PERIA_INTA216,DTCE_PERIA_INTA217,DTCE_PERIA_INTA218,DTCE_PERIA_INTA219,
DTCE_PERIA_INTA220,DTCE_PERIA_INTA221,DTCE_PERIA_INTA222,DTCE_PERIA_INTA223,DTCE_PERIA_INTA224,DTCE_PERIA_INTA225,
DTCE_PERIA_INTA226,DTCE_PERIA_INTA227,DTCE_PERIA_INTA228,DTCE_PERIA_INTA229,DTCE_PERIA_INTA230,DTCE_PERIA_INTA231,
DTCE_PERIA_INTA232,DTCE_PERIA_INTA233,DTCE_PERIA_INTA234,DTCE_PERIA_INTA235,DTCE_PERIA_INTA236,DTCE_PERIA_INTA237,
DTCE_PERIA_INTA238,DTCE_PERIA_INTA239,DTCE_PERIA_INTA240,DTCE_PERIA_INTA241,DTCE_PERIA_INTA242,DTCE_PERIA_INTA243,
DTCE_PERIA_INTA244,DTCE_PERIA_INTA245,DTCE_PERIA_INTA246,DTCE_PERIA_INTA247,DTCE_PERIA_INTA248,DTCE_PERIA_INTA249,
DTCE_PERIA_INTA250,DTCE_PERIA_INTA251,DTCE_PERIA_INTA252,DTCE_PERIA_INTA253,DTCE_PERIA_INTA254,DTCE_PERIA_INTA255
} enum_dtce_t;

typedef enum enum_ier {
IER_BSC_BUSERR=0x02,
IER_RAM_RAMERR=0x02,
IER_FCU_FIFERR=0x02,IER_FCU_FRDYI=0x02,
IER_ICU_SWINT2=0x03,IER_ICU_SWINT=0x03,
IER_CMT0_CMI0=0x03,
IER_CMT1_CMI1=0x03,
IER_CMT2_CMI2=0x03,
IER_CMT3_CMI3=0x03,
IER_RSPI0_SPRI0=0x04,IER_RSPI0_SPTI0=0x04,
IER_RI3C0_RESPI=0x05,IER_RI3C0_CMDI=0x05,IER_RI3C0_IBII=0x05,IER_RI3C0_RCVI=0x05,
IER_RSPIA0_SPRI=0x06,IER_RSPIA0_SPTI=0x06,
IER_RIIC0_RXI0=0x06,IER_RIIC0_TXI0=0x06,
IER_SCI1_RXI1=0x07,IER_SCI1_TXI1=0x07,
IER_ICU_IRQ0=0x08,IER_ICU_IRQ1=0x08,IER_ICU_IRQ2=0x08,IER_ICU_IRQ3=0x08,IER_ICU_IRQ4=0x08,IER_ICU_IRQ5=0x08,IER_ICU_IRQ6=0x08,IER_ICU_IRQ7=0x08,
IER_ICU_IRQ8=0x09,IER_ICU_IRQ9=0x09,IER_ICU_IRQ10=0x09,IER_ICU_IRQ11=0x09,IER_ICU_IRQ12=0x09,IER_ICU_IRQ13=0x09,IER_ICU_IRQ14=0x09,IER_ICU_IRQ15=0x09,
IER_SCI5_RXI5=0x0A,IER_SCI5_TXI5=0x0A,
IER_SCI6_RXI6=0x0A,IER_SCI6_TXI6=0x0A,
IER_LVD1_LVD1=0x0B,
IER_LVD2_LVD2=0x0B,
IER_IWDT_IWUNI=0x0B,
IER_WDT_WUNI=0x0C,
IER_RSCI8_RXI=0x0C,IER_RSCI8_TXI=0x0C,
IER_RSCI9_RXI=0x0C,IER_RSCI9_TXI=0x0C,
IER_ICU_GROUPBL2=0x0D,IER_ICU_GROUPBL0=0x0D,IER_ICU_GROUPBL1=0x0D,IER_ICU_GROUPAL0=0x0E,IER_ICU_GROUPAL1=0x0E,
IER_RSCI11_RXI=0x0E,IER_RSCI11_TXI=0x0E,
IER_SCI12_RXI12=0x0E,IER_SCI12_TXI12=0x0E,
IER_RI3C0_RXI=0x0E,IER_RI3C0_TXI=0x0E,
IER_DMAC_DMAC0I=0x0F,IER_DMAC_DMAC1I=0x0F,IER_DMAC_DMAC2I=0x0F,IER_DMAC_DMAC3I=0x0F,IER_DMAC_DMAC74I=0x0F,
IER_OST_OSTDI=0x0F,
IER_S12AD_S12ADI=0x10,IER_S12AD_S12GBADI=0x10,IER_S12AD_S12GCADI=0x10,
IER_S12AD1_S12ADI1=0x10,IER_S12AD1_S12GBADI1=0x10,IER_S12AD1_S12GCADI1=0x10,
IER_S12AD2_S12ADI2=0x11,IER_S12AD2_S12GBADI2=0x11,IER_S12AD2_S12GCADI2=0x11,
IER_CANFD_RFDREQ0=0x11,IER_CANFD_RFDREQ1=0x11,
IER_CANFD0_CFDREQ0=0x11,
IER_TMR0_CMIA0=0x12,IER_TMR0_CMIB0=0x12,IER_TMR0_OVI0=0x12,
IER_TMR1_CMIA1=0x12,IER_TMR1_CMIB1=0x12,IER_TMR1_OVI1=0x12,
IER_TMR2_CMIA2=0x13,IER_TMR2_CMIB2=0x13,IER_TMR2_OVI2=0x13,
IER_TMR3_CMIA3=0x13,IER_TMR3_CMIB3=0x13,IER_TMR3_OVI3=0x13,
IER_TMR4_CMIA4=0x13,IER_TMR4_CMIB4=0x13,IER_TMR4_OVI4=0x14,
IER_TMR5_CMIA5=0x14,IER_TMR5_CMIB5=0x14,IER_TMR5_OVI5=0x14,
IER_TMR6_CMIA6=0x14,IER_TMR6_CMIB6=0x14,IER_TMR6_OVI6=0x14,
IER_TMR7_CMIA7=0x14,IER_TMR7_CMIB7=0x15,IER_TMR7_OVI7=0x15,
IER_ELC_ELSR18I=0x15,IER_ELC_ELSR19I=0x16,
IER_TSIP_RD=0x16,IER_TSIP_WR=0x16,IER_TSIP_ERR=0x16,
IER_CMPC0_CMPC0=0x16,
IER_CMPC1_CMPC1=0x16,
IER_CMPC2_CMPC2=0x16,
IER_CMPC3_CMPC3=0x16,
IER_CMPC4_CMPC4=0x17,
IER_CMPC5_CMPC5=0x17,
IER_CMTW0_CMWI0=0x17,IER_CMTW0_IC0I0=0x17,IER_CMTW0_IC1I0=0x17,IER_CMTW0_OC0I0=0x17,IER_CMTW0_OC1I0=0x17,
IER_CMTW1_CMWI1=0x17,IER_CMTW1_IC0I1=0x18,IER_CMTW1_IC1I1=0x18,IER_CMTW1_OC0I1=0x18,IER_CMTW1_OC1I1=0x18,
IER_RSCI9_AED=0x18,
IER_PERIA_INTA208=0x1A,IER_PERIA_INTA209=0x1A,IER_PERIA_INTA210=0x1A,IER_PERIA_INTA211=0x1A,IER_PERIA_INTA212=0x1A,IER_PERIA_INTA213=0x1A,IER_PERIA_INTA214=0x1A,
IER_PERIA_INTA215=0x1A,IER_PERIA_INTA216=0x1B,IER_PERIA_INTA217=0x1B,IER_PERIA_INTA218=0x1B,IER_PERIA_INTA219=0x1B,IER_PERIA_INTA220=0x1B,IER_PERIA_INTA221=0x1B,
IER_PERIA_INTA222=0x1B,IER_PERIA_INTA223=0x1B,IER_PERIA_INTA224=0x1C,IER_PERIA_INTA225=0x1C,IER_PERIA_INTA226=0x1C,IER_PERIA_INTA227=0x1C,IER_PERIA_INTA228=0x1C,
IER_PERIA_INTA229=0x1C,IER_PERIA_INTA230=0x1C,IER_PERIA_INTA231=0x1C,IER_PERIA_INTA232=0x1D,IER_PERIA_INTA233=0x1D,IER_PERIA_INTA234=0x1D,IER_PERIA_INTA235=0x1D,
IER_PERIA_INTA236=0x1D,IER_PERIA_INTA237=0x1D,IER_PERIA_INTA238=0x1D,IER_PERIA_INTA239=0x1D,IER_PERIA_INTA240=0x1E,IER_PERIA_INTA241=0x1E,IER_PERIA_INTA242=0x1E,
IER_PERIA_INTA243=0x1E,IER_PERIA_INTA244=0x1E,IER_PERIA_INTA245=0x1E,IER_PERIA_INTA246=0x1E,IER_PERIA_INTA247=0x1E,IER_PERIA_INTA248=0x1F,IER_PERIA_INTA249=0x1F,
IER_PERIA_INTA250=0x1F,IER_PERIA_INTA251=0x1F,IER_PERIA_INTA252=0x1F,IER_PERIA_INTA253=0x1F,IER_PERIA_INTA254=0x1F,IER_PERIA_INTA255=0x1F
} enum_ier_t;

typedef enum enum_ipr {
IPR_BSC_BUSERR=0,
IPR_RAM_RAMERR=0,
IPR_FCU_FIFERR=1,IPR_FCU_FRDYI=2,
IPR_ICU_SWINT2=3,IPR_ICU_SWINT=3,
IPR_CMT0_CMI0=4,
IPR_CMT1_CMI1=5,
IPR_CMT2_CMI2=6,
IPR_CMT3_CMI3=7,
IPR_RSPI0_SPRI0=38,IPR_RSPI0_SPTI0=39,
IPR_RI3C0_RESPI=40,IPR_RI3C0_CMDI=41,IPR_RI3C0_IBII=42,IPR_RI3C0_RCVI=43,
IPR_RSPIA0_SPRI=48,IPR_RSPIA0_SPTI=49,
IPR_RIIC0_RXI0=52,IPR_RIIC0_TXI0=53,
IPR_SCI1_RXI1=60,IPR_SCI1_TXI1=61,
IPR_ICU_IRQ0=64,IPR_ICU_IRQ1=65,IPR_ICU_IRQ2=66,IPR_ICU_IRQ3=67,IPR_ICU_IRQ4=68,IPR_ICU_IRQ5=69,IPR_ICU_IRQ6=70,IPR_ICU_IRQ7=71,
IPR_ICU_IRQ8=72,IPR_ICU_IRQ9=73,IPR_ICU_IRQ10=74,IPR_ICU_IRQ11=75,IPR_ICU_IRQ12=76,IPR_ICU_IRQ13=77,IPR_ICU_IRQ14=78,IPR_ICU_IRQ15=79,
IPR_SCI5_RXI5=84,IPR_SCI5_TXI5=85,
IPR_SCI6_RXI6=86,IPR_SCI6_TXI6=87,
IPR_LVD1_LVD1=88,
IPR_LVD2_LVD2=89,
IPR_IWDT_IWUNI=95,
IPR_WDT_WUNI=96,
IPR_RSCI8_RXI=100,IPR_RSCI8_TXI=101,
IPR_RSCI9_RXI=102,IPR_RSCI9_TXI=103,
IPR_ICU_GROUPBL2=107,IPR_ICU_GROUPBL0=110,IPR_ICU_GROUPBL1=111,IPR_ICU_GROUPAL0=112,IPR_ICU_GROUPAL1=113,
IPR_RSCI11_RXI=114,IPR_RSCI11_TXI=115,
IPR_SCI12_RXI12=116,IPR_SCI12_TXI12=117,
IPR_RI3C0_RXI=118,IPR_RI3C0_TXI=119,
IPR_DMAC_DMAC0I=120,IPR_DMAC_DMAC1I=121,IPR_DMAC_DMAC2I=122,IPR_DMAC_DMAC3I=123,IPR_DMAC_DMAC74I=124,
IPR_OST_OSTDI=125,
IPR_S12AD_S12ADI=128,IPR_S12AD_S12GBADI=129,IPR_S12AD_S12GCADI=130,
IPR_S12AD1_S12ADI1=132,IPR_S12AD1_S12GBADI1=133,IPR_S12AD1_S12GCADI1=134,
IPR_S12AD2_S12ADI2=136,IPR_S12AD2_S12GBADI2=137,IPR_S12AD2_S12GCADI2=138,
IPR_CANFD_RFDREQ0=140,IPR_CANFD_RFDREQ1=141,
IPR_CANFD0_CFDREQ0=142,
IPR_TMR0_CMIA0=146,IPR_TMR0_CMIB0=146,IPR_TMR0_OVI0=146,
IPR_TMR1_CMIA1=149,IPR_TMR1_CMIB1=149,IPR_TMR1_OVI1=149,
IPR_TMR2_CMIA2=152,IPR_TMR2_CMIB2=152,IPR_TMR2_OVI2=152,
IPR_TMR3_CMIA3=155,IPR_TMR3_CMIB3=155,IPR_TMR3_OVI3=155,
IPR_TMR4_CMIA4=158,IPR_TMR4_CMIB4=158,IPR_TMR4_OVI4=158,
IPR_TMR5_CMIA5=161,IPR_TMR5_CMIB5=161,IPR_TMR5_OVI5=161,
IPR_TMR6_CMIA6=164,IPR_TMR6_CMIB6=164,IPR_TMR6_OVI6=164,
IPR_TMR7_CMIA7=167,IPR_TMR7_CMIB7=167,IPR_TMR7_OVI7=167,
IPR_ELC_ELSR18I=175,IPR_ELC_ELSR19I=176,
IPR_TSIP_RD=177,IPR_TSIP_WR=177,IPR_TSIP_ERR=179,
IPR_CMPC0_CMPC0=180,
IPR_CMPC1_CMPC1=181,
IPR_CMPC2_CMPC2=182,
IPR_CMPC3_CMPC3=183,
IPR_CMPC4_CMPC4=184,
IPR_CMPC5_CMPC5=185,
IPR_CMTW0_CMWI0=186,IPR_CMTW0_IC0I0=187,IPR_CMTW0_IC1I0=188,IPR_CMTW0_OC0I0=189,IPR_CMTW0_OC1I0=190,
IPR_CMTW1_CMWI1=191,IPR_CMTW1_IC0I1=192,IPR_CMTW1_IC1I1=193,IPR_CMTW1_OC0I1=194,IPR_CMTW1_OC1I1=195,
IPR_RSCI9_AED=197,
IPR_PERIA_INTA208=208,IPR_PERIA_INTA209=209,IPR_PERIA_INTA210=210,IPR_PERIA_INTA211=211,IPR_PERIA_INTA212=212,IPR_PERIA_INTA213=213,
IPR_PERIA_INTA214=214,IPR_PERIA_INTA215=215,IPR_PERIA_INTA216=216,IPR_PERIA_INTA217=217,IPR_PERIA_INTA218=218,IPR_PERIA_INTA219=219,
IPR_PERIA_INTA220=220,IPR_PERIA_INTA221=221,IPR_PERIA_INTA222=222,IPR_PERIA_INTA223=223,IPR_PERIA_INTA224=224,IPR_PERIA_INTA225=225,
IPR_PERIA_INTA226=226,IPR_PERIA_INTA227=227,IPR_PERIA_INTA228=228,IPR_PERIA_INTA229=229,IPR_PERIA_INTA230=230,IPR_PERIA_INTA231=231,
IPR_PERIA_INTA232=232,IPR_PERIA_INTA233=233,IPR_PERIA_INTA234=234,IPR_PERIA_INTA235=235,IPR_PERIA_INTA236=236,IPR_PERIA_INTA237=237,
IPR_PERIA_INTA238=238,IPR_PERIA_INTA239=239,IPR_PERIA_INTA240=240,IPR_PERIA_INTA241=241,IPR_PERIA_INTA242=242,IPR_PERIA_INTA243=243,
IPR_PERIA_INTA244=244,IPR_PERIA_INTA245=245,IPR_PERIA_INTA246=246,IPR_PERIA_INTA247=247,IPR_PERIA_INTA248=248,IPR_PERIA_INTA249=249,
IPR_PERIA_INTA250=250,IPR_PERIA_INTA251=251,IPR_PERIA_INTA252=252,IPR_PERIA_INTA253=253,IPR_PERIA_INTA254=254,IPR_PERIA_INTA255=255,
IPR_ICU_SWI=3,
IPR_CMT0_=4,
IPR_CMT1_=5,
IPR_CMT2_=6,
IPR_CMT3_=7,
IPR_LVD1_=88,
IPR_LVD2_=89,
IPR_IWDT_=95,
IPR_WDT_=96,
IPR_OST_=125,
IPR_CANFD0_=142,
IPR_TMR0_=146,
IPR_TMR1_=149,
IPR_TMR2_=152,
IPR_TMR3_=155,
IPR_TMR4_=158,
IPR_TMR5_=161,
IPR_TMR6_=164,
IPR_TMR7_=167,
IPR_CMPC0_=180,
IPR_CMPC1_=181,
IPR_CMPC2_=182,
IPR_CMPC3_=183,
IPR_CMPC4_=184,
IPR_CMPC5_=185
} enum_ipr_t;


#pragma pack(4)


typedef struct st_bsc {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char STSCLR : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char STSCLR : 1;
#endif
	} BIT;
	} BERCLR;
	char           wk0[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char IGAEN : 1;
			unsigned char TOEN : 1;
			unsigned char  : 6;
#else
			unsigned char  : 6;
			unsigned char TOEN : 1;
			unsigned char IGAEN : 1;
#endif
	} BIT;
	} BEREN;
	char           wk1[3];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char IA : 1;
			unsigned char TO : 1;
			unsigned char  : 2;
			unsigned char MST : 3;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char MST : 3;
			unsigned char  : 2;
			unsigned char TO : 1;
			unsigned char IA : 1;
#endif
	} BIT;
	} BERSR1;
	char           wk2[1];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 3;
			unsigned short ADDR : 13;
#else
			unsigned short ADDR : 13;
			unsigned short  : 3;
#endif
	} BIT;
	} BERSR2;
	char           wk3[4];
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short BPRA : 2;
			unsigned short BPRO : 2;
			unsigned short BPIB : 2;
			unsigned short BPGB : 2;
			unsigned short BPHB : 2;
			unsigned short BPFB : 2;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short BPFB : 2;
			unsigned short BPHB : 2;
			unsigned short BPGB : 2;
			unsigned short BPIB : 2;
			unsigned short BPRO : 2;
			unsigned short BPRA : 2;
#endif
	} BIT;
	} BUSPRI;
} st_bsc_t;

typedef struct st_cac {
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CFME : 1;
			unsigned char  : 7;
#else
			unsigned char  : 7;
			unsigned char CFME : 1;
#endif
	} BIT;
	} CACR0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char CACREFE : 1;
			unsigned char FMCS : 3;
			unsigned char TCSS : 2;
			unsigned char EDGES : 2;
#else
			unsigned char EDGES : 2;
			unsigned char TCSS : 2;
			unsigned char FMCS : 3;
			unsigned char CACREFE : 1;
#endif
	} BIT;
	} CACR1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char RPS : 1;
			unsigned char RSCS : 3;
			unsigned char RCDS : 2;
			unsigned char DFS : 2;
#else
			unsigned char DFS : 2;
			unsigned char RCDS : 2;
			unsigned char RSCS : 3;
			unsigned char RPS : 1;
#endif
	} BIT;
	} CACR2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FERRIE : 1;
			unsigned char MENDIE : 1;
			unsigned char OVFIE : 1;
			unsigned char  : 1;
			unsigned char FERRFCL : 1;
			unsigned char MENDFCL : 1;
			unsigned char OVFFCL : 1;
			unsigned char  : 1;
#else
			unsigned char  : 1;
			unsigned char OVFFCL : 1;
			unsigned char MENDFCL : 1;
			unsigned char FERRFCL : 1;
			unsigned char  : 1;
			unsigned char OVFIE : 1;
			unsigned char MENDIE : 1;
			unsigned char FERRIE : 1;
#endif
	} BIT;
	} CAICR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char FERRF : 1;
			unsigned char MENDF : 1;
			unsigned char OVFF : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char OVFF : 1;
			unsigned char MENDF : 1;
			unsigned char FERRF : 1;
#endif
	} BIT;
	} CASTR;
	char           wk0[1];
	unsigned short CAULVR;
	unsigned short CALLVR;
	unsigned short CACNTBR;
} st_cac_t;

typedef struct st_canfd {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TPRI : 1;
			unsigned long DCE : 1;
			unsigned long DRE : 1;
			unsigned long MME : 1;
			unsigned long DLLCS : 1;
			unsigned long OMRC : 1;
			unsigned long  : 2;
			unsigned long TSP : 4;
			unsigned long TSCS : 1;
			unsigned long  : 3;
			unsigned long ITP : 16;
#else
			unsigned long ITP : 16;
			unsigned long  : 3;
			unsigned long TSCS : 1;
			unsigned long TSP : 4;
			unsigned long  : 2;
			unsigned long OMRC : 1;
			unsigned long DLLCS : 1;
			unsigned long MME : 1;
			unsigned long DRE : 1;
			unsigned long DCE : 1;
			unsigned long TPRI : 1;
#endif
	} BIT;
	} GCFG;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MDC : 2;
			unsigned long SLPRQ : 1;
			unsigned long  : 5;
			unsigned long DEIE : 1;
			unsigned long MLIE : 1;
			unsigned long THLIE : 1;
			unsigned long POIE : 1;
			unsigned long  : 4;
			unsigned long TSCR : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long TSCR : 1;
			unsigned long  : 4;
			unsigned long POIE : 1;
			unsigned long THLIE : 1;
			unsigned long MLIE : 1;
			unsigned long DEIE : 1;
			unsigned long  : 5;
			unsigned long SLPRQ : 1;
			unsigned long MDC : 2;
#endif
	} BIT;
	} GCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RSTST : 1;
			unsigned long HLTST : 1;
			unsigned long SLPST : 1;
			unsigned long RAMST : 1;
			unsigned long  : 28;
#else
			unsigned long  : 28;
			unsigned long RAMST : 1;
			unsigned long SLPST : 1;
			unsigned long HLTST : 1;
			unsigned long RSTST : 1;
#endif
	} BIT;
	} GSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DEDF : 1;
			unsigned long MLDF : 1;
			unsigned long THLDF : 1;
			unsigned long PODF : 1;
			unsigned long  : 12;
			unsigned long EEDF0 : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long EEDF0 : 1;
			unsigned long  : 12;
			unsigned long PODF : 1;
			unsigned long THLDF : 1;
			unsigned long MLDF : 1;
			unsigned long DEDF : 1;
#endif
	} BIT;
	} GESR;
	unsigned long  TSCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PAGE : 1;
			unsigned long  : 7;
			unsigned long AFLWE : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long AFLWE : 1;
			unsigned long  : 7;
			unsigned long PAGE : 1;
#endif
	} BIT;
	} AFCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 16;
			unsigned long RN0 : 6;
			unsigned long  : 10;
#else
			unsigned long  : 10;
			unsigned long RN0 : 6;
			unsigned long  : 16;
#endif
	} BIT;
	} AFCFG;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long NMB : 6;
			unsigned long  : 2;
			unsigned long PLS : 3;
			unsigned long  : 21;
#else
			unsigned long  : 21;
			unsigned long PLS : 3;
			unsigned long  : 2;
			unsigned long NMB : 6;
#endif
	} BIT;
	} RMCR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long NDF : 32;
#else
			unsigned long NDF : 32;
#endif
	} BIT;
	} RMNDR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RMIE0 : 1;
			unsigned long RMIE1 : 1;
			unsigned long RMIE2 : 1;
			unsigned long RMIE3 : 1;
			unsigned long RMIE4 : 1;
			unsigned long RMIE5 : 1;
			unsigned long RMIE6 : 1;
			unsigned long RMIE7 : 1;
			unsigned long RMIE8 : 1;
			unsigned long RMIE9 : 1;
			unsigned long RMIE10 : 1;
			unsigned long RMIE11 : 1;
			unsigned long RMIE12 : 1;
			unsigned long RMIE13 : 1;
			unsigned long RMIE14 : 1;
			unsigned long RMIE15 : 1;
			unsigned long RMIE16 : 1;
			unsigned long RMIE17 : 1;
			unsigned long RMIE18 : 1;
			unsigned long RMIE19 : 1;
			unsigned long RMIE20 : 1;
			unsigned long RMIE21 : 1;
			unsigned long RMIE22 : 1;
			unsigned long RMIE23 : 1;
			unsigned long RMIE24 : 1;
			unsigned long RMIE25 : 1;
			unsigned long RMIE26 : 1;
			unsigned long RMIE27 : 1;
			unsigned long RMIE28 : 1;
			unsigned long RMIE29 : 1;
			unsigned long RMIE30 : 1;
			unsigned long RMIE31 : 1;
#else
			unsigned long RMIE31 : 1;
			unsigned long RMIE30 : 1;
			unsigned long RMIE29 : 1;
			unsigned long RMIE28 : 1;
			unsigned long RMIE27 : 1;
			unsigned long RMIE26 : 1;
			unsigned long RMIE25 : 1;
			unsigned long RMIE24 : 1;
			unsigned long RMIE23 : 1;
			unsigned long RMIE22 : 1;
			unsigned long RMIE21 : 1;
			unsigned long RMIE20 : 1;
			unsigned long RMIE19 : 1;
			unsigned long RMIE18 : 1;
			unsigned long RMIE17 : 1;
			unsigned long RMIE16 : 1;
			unsigned long RMIE15 : 1;
			unsigned long RMIE14 : 1;
			unsigned long RMIE13 : 1;
			unsigned long RMIE12 : 1;
			unsigned long RMIE11 : 1;
			unsigned long RMIE10 : 1;
			unsigned long RMIE9 : 1;
			unsigned long RMIE8 : 1;
			unsigned long RMIE7 : 1;
			unsigned long RMIE6 : 1;
			unsigned long RMIE5 : 1;
			unsigned long RMIE4 : 1;
			unsigned long RMIE3 : 1;
			unsigned long RMIE2 : 1;
			unsigned long RMIE1 : 1;
			unsigned long RMIE0 : 1;
#endif
	} BIT;
	} RMIER;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFE : 1;
			unsigned long RFIE : 1;
			unsigned long  : 2;
			unsigned long PLS : 3;
			unsigned long  : 1;
			unsigned long FDS : 3;
			unsigned long  : 1;
			unsigned long RFIM : 1;
			unsigned long RFITH : 3;
			unsigned long  : 16;
#else
			unsigned long  : 16;
			unsigned long RFITH : 3;
			unsigned long RFIM : 1;
			unsigned long  : 1;
			unsigned long FDS : 3;
			unsigned long  : 1;
			unsigned long PLS : 3;
			unsigned long  : 2;
			unsigned long RFIE : 1;
			unsigned long RFE : 1;
#endif
	} BIT;
	} RFCR[2];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EMPTY : 1;
			unsigned long FULL : 1;
			unsigned long LOST : 1;
			unsigned long RFIF : 1;
			unsigned long  : 4;
			unsigned long FLVL : 6;
			unsigned long  : 18;
#else
			unsigned long  : 18;
			unsigned long FLVL : 6;
			unsigned long  : 4;
			unsigned long RFIF : 1;
			unsigned long LOST : 1;
			unsigned long FULL : 1;
			unsigned long EMPTY : 1;
#endif
	} BIT;
	} RFSR[2];
	unsigned long  RFPCR[2];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CFE : 1;
			unsigned long CFRIE : 1;
			unsigned long CFTIE : 1;
			unsigned long  : 1;
			unsigned long PLS : 3;
			unsigned long  : 1;
			unsigned long MODE : 1;
			unsigned long  : 1;
			unsigned long ITCS : 1;
			unsigned long ITR : 1;
			unsigned long CFIM : 1;
			unsigned long CFITH : 3;
			unsigned long LTM : 2;
			unsigned long  : 3;
			unsigned long FDS : 3;
			unsigned long TINT : 8;
#else
			unsigned long TINT : 8;
			unsigned long FDS : 3;
			unsigned long  : 3;
			unsigned long LTM : 2;
			unsigned long CFITH : 3;
			unsigned long CFIM : 1;
			unsigned long ITR : 1;
			unsigned long ITCS : 1;
			unsigned long  : 1;
			unsigned long MODE : 1;
			unsigned long  : 1;
			unsigned long PLS : 3;
			unsigned long  : 1;
			unsigned long CFTIE : 1;
			unsigned long CFRIE : 1;
			unsigned long CFE : 1;
#endif
	} BIT;
	} CFCR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long EMPTY : 1;
			unsigned long FULL : 1;
			unsigned long LOST : 1;
			unsigned long CFRIF : 1;
			unsigned long CFTIF : 1;
			unsigned long  : 3;
			unsigned long FLVL : 6;
			unsigned long  : 18;
#else
			unsigned long  : 18;
			unsigned long FLVL : 6;
			unsigned long  : 3;
			unsigned long CFTIF : 1;
			unsigned long CFRIF : 1;
			unsigned long LOST : 1;
			unsigned long FULL : 1;
			unsigned long EMPTY : 1;
#endif
	} BIT;
	} CFSR0;
	unsigned long  CFPCR0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFEMP0 : 1;
			unsigned long RFEMP1 : 1;
			unsigned long  : 6;
			unsigned long CFEMP0 : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long CFEMP0 : 1;
			unsigned long  : 6;
			unsigned long RFEMP1 : 1;
			unsigned long RFEMP0 : 1;
#endif
	} BIT;
	} FESR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFFUL0 : 1;
			unsigned long RFFUL1 : 1;
			unsigned long  : 6;
			unsigned long CFFUL0 : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long CFFUL0 : 1;
			unsigned long  : 6;
			unsigned long RFFUL1 : 1;
			unsigned long RFFUL0 : 1;
#endif
	} BIT;
	} FFSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFML0 : 1;
			unsigned long RFML1 : 1;
			unsigned long  : 6;
			unsigned long CFML0 : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long CFML0 : 1;
			unsigned long  : 6;
			unsigned long RFML1 : 1;
			unsigned long RFML0 : 1;
#endif
	} BIT;
	} FMLSR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long RFIF0 : 1;
			unsigned long RFIF1 : 1;
			unsigned long  : 30;
#else
			unsigned long  : 30;
			unsigned long RFIF1 : 1;
			unsigned long RFIF0 : 1;
#endif
	} BIT;
	} RFISR;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TXRQ : 1;
			unsigned char TARQ : 1;
			unsigned char ONESHOT : 1;
			unsigned char  : 5;
#else
			unsigned char  : 5;
			unsigned char ONESHOT : 1;
			unsigned char TARQ : 1;
			unsigned char TXRQ : 1;
#endif
	} BIT;
	} TMCR[4];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char TXSF : 1;
			unsigned char TXRF : 2;
			unsigned char TXRQS : 1;
			unsigned char TARQS : 1;
			unsigned char  : 3;
#else
			unsigned char  : 3;
			unsigned char TARQS : 1;
			unsigned char TXRQS : 1;
			unsigned char TXRF : 2;
			unsigned char TXSF : 1;
#endif
	} BIT;
	} TMSR[4];
	union {
		unsigned long LONG;
		struct {
			
